УправлениеВетеринарнойКлиникой/src/Documents/ПоступлениеНаРассчетныйСчет/ПоступлениеНаРассчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРассчетныйСчет</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.АвансыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/AccumulationRegisters/ЗадолженностьПокупателей/ЗадолженностьПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженностьПокупателей</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеВетеринарнойКлиникой/src/AccumulationRegisters/АвансыПокупателей/АвансыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АвансыПокупателей</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеВетеринарнойКлиникой/src/Documents/ПоступлениеНаРассчетныйСчет/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Чек") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.Сумма;
		Ответственный = ДанныеЗаполнения.Ответственный;

	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияВзаиморасчетыСПокупателями();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияВзаиморасчетыСПокупателями()

	Движения.ЗадолженностьПокупателей.Записывать = Истина;
	Движения.АвансыПокупателей.Записывать = Истина;
	Движения.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗадолженностьПокупателей");
	ЭлементБлокировки.УстановитьЗначение("Клиент", Клиент);
	ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.АвансыПокупателей");
	ЭлементБлокировки.УстановитьЗначение("Клиент", Клиент);
	ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	Движения.ЗадолженностьПокупателей.Записывать = Истина;
	Движения.АвансыПокупателей.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженностьПокупателейОстатки.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПокупателей.Остатки(
		|			&Период,
		|			Клиент = &Клиент
		|				И Договор = &Договор) КАК ЗадолженностьПокупателейОстатки";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Долг = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Долг = РезультатЗапроса.Долг;
	КонецЕсли;
	
	Если Сумма <= Долг Тогда
		
		Движение = Движения.ЗадолженностьПокупателей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Клиент = Клиент;
		Движение.Сумма = Сумма;
	Иначе
		
		Если Долг > 0 Тогда
			Движение = Движения.ЗадолженностьПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = Долг;
		КонецЕсли;
		
		ОстатокАванса = Сумма - Долг;
		
		Если ОстатокАванса > 0 Тогда
			Движение = Движения.АвансыПокупателей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Клиент = Клиент;
			Движение.Сумма = ОстатокАванса;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
